Revit 2024 API
IFCLevelInfo.GetLocalPlacement Method
 Gets the local placement.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IFCAnyHandle GetLocalPlacement()
Visual Basic
Public Function GetLocalPlacement As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ GetLocalPlacement()
Return Value
 The local placement.
See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace